In [1]:
import pandas as pd
import datetime as dt
import numpy as np

### Converting to a Timestamp

In [2]:
pd.Timestamp(dt.datetime(2022,3,6))

Timestamp('2022-03-06 00:00:00')

In [3]:
pd.Timestamp(2022,3,6)

Timestamp('2022-03-06 00:00:00')

In [4]:
pd.Timestamp('2022-03-06')

Timestamp('2022-03-06 00:00:00')

In [24]:
pd.to_datetime(pd.Series(['Jul 31, 2020','2021-01-01',None]))

0   2020-07-31
1   2021-01-01
2          NaT
dtype: datetime64[ns]

In [5]:
pd.to_datetime('2021/09/12', format = '%Y/%d/%m')

Timestamp('2021-12-09 00:00:00')

### Converting to a specific format

In [28]:
pd.to_datetime('08-10-2022 12:30', format = '%d-%m-%Y  %H:%M').strftime('%d/%m/%Y')

'08/10/2022'

### Timestamp conversion on dataframe

In [7]:
data = pd.read_csv('AirPassengers.csv')
data.head()

     Month  #Passengers
0  1949-01          112
1  1949-02          118
2  1949-03          132
3  1949-04          129
4  1949-05          121

In [8]:
data.dtypes

Month          object
#Passengers     int64
dtype: object

In [9]:
#What is the difference in no of passengers in the first two months
data.Month[1] - data.Month[0]

TypeError: unsupported operand type(s) for -: 'str' and 'str'

We are getting error because the column is not in a datetime format. Its string and string doesnt allow any mathematical operation

### Converting the Month column to datetime object

In [10]:
#Adding the date to my Time index i.e. YYYY-MM-DD
data['Month'] = data['Month'].apply(lambda x : dt.datetime(int(x[:4]), int(x[5:]), 15))
data.head()

       Month  #Passengers
0 1949-01-15          112
1 1949-02-15          118
2 1949-03-15          132
3 1949-04-15          129
4 1949-05-15          121

In [6]:
data.dtypes

Month          datetime64[ns]
#Passengers             int64
dtype: object

In [11]:
data.Month[4] - data.Month[0]

Timedelta('120 days 00:00:00')

In [36]:
data[data['Month'] <= '1949-04-15']

       Month  #Passengers
0 1949-01-15          112
1 1949-02-15          118
2 1949-03-15          132
3 1949-04-15          129

### Rolling window Statistics

In [37]:
data

         Month  #Passengers
0   1949-01-15          112
1   1949-02-15          118
2   1949-03-15          132
3   1949-04-15          129
4   1949-05-15          121
..         ...          ...
139 1960-08-15          606
140 1960-09-15          508
141 1960-10-15          461
142 1960-11-15          390
143 1960-12-15          432

[144 rows x 2 columns]

In [13]:
data.rolling(window=5).mean()

     #Passengers
0            NaN
1            NaN
2            NaN
3            NaN
4          122.4
..           ...
139        539.2
140        548.6
141        546.4
142        517.4
143        479.4

[144 rows x 1 columns]

In [19]:
data.rolling(window=3).std()

     #Passengers
0            NaN
1            NaN
2      10.263203
3       7.371115
4       5.686241
..           ...
139    46.306947
140    61.719797
141    73.979727
142    59.405387
143    35.697806

[144 rows x 1 columns]